Revit 2027 API
ExtendedPropertiesBindings.AddCategories Method
 Adds multiple categories to the bindings.
Namespace: Autodesk.Revit.DB.ExternalData
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void AddCategories(
	ICollection<ForgeTypeId> categories
)
Public Sub AddCategories (
	categories As ICollection(Of ForgeTypeId)
)
public:
void AddCategories(
	ICollection<ForgeTypeId^>^ categories
)
member AddCategories :
        categories : ICollection<ForgeTypeId> -> unit
Parameters
categories ICollection<ForgeTypeId>
 Identifiers of the categories.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ExtendedPropertiesBindings Class
Autodesk.Revit.DB.ExternalData Namespace